GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
/*
 * Copyright (c) 2015-2018 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv6m.h"
#include "stm32l0xx.h"

#include "gnss_api.h"
#include "stm32l0_rtc.h"
#include "stm32l0_gpio.h"

/*
 * NOTES:
 *
 * SiRF/CSR
 *
 * $PSRFEPE,074155.799,A,1.3,10.59,52.97,0.6,180.0*16 
 *
 *     UTC
 *     Status       A/V (A == Valid, V = Invalid)
 *     HOP
 *     EHPE
 *     EVPE
 *     EHVE         Expected Horizontal Velocity Error
 *     EHE          Expected Heading Error
 *
 * Per NMEA definition GGA should be only GPGGA, while GNS can be GPGNS/GLGNS/GNGNS ...
 *
 * GPS        1-32
 * GLONASS    65-88
 * BEIDOU     121-157
 *
 */

/************************************************************************************/

#define NMEA_SENTENCE_MASK_GPGGA                      0x00000001
#define NMEA_SENTENCE_MASK_GPGSA                      0x00000002
#define NMEA_SENTENCE_MASK_GPGST                      0x00000004
#define NMEA_SENTENCE_MASK_GPGSV                      0x00000008
#define NMEA_SENTENCE_MASK_GPRMC                      0x00000010
#define NMEA_SENTENCE_MASK_GLGSA                      0x00000020
#define NMEA_SENTENCE_MASK_GLGSV                      0x00000040
#define NMEA_SENTENCE_MASK_SOLUTION                   0x00008000

#define NMEA_FIELD_SEQUENCE_START                     0
#define NMEA_FIELD_SEQUENCE_SKIP                      1
#define NMEA_FIELD_SEQUENCE_GGA_TIME                  2
#define NMEA_FIELD_SEQUENCE_GGA_LATITUDE              3
#define NMEA_FIELD_SEQUENCE_GGA_LATITUDE_NS           4
#define NMEA_FIELD_SEQUENCE_GGA_LONGITUDE             5
#define NMEA_FIELD_SEQUENCE_GGA_LONGITUDE_EW          6
#define NMEA_FIELD_SEQUENCE_GGA_QUALITY               7
#define NMEA_FIELD_SEQUENCE_GGA_NUMSV                 8
#define NMEA_FIELD_SEQUENCE_GGA_HDOP                  9
#define NMEA_FIELD_SEQUENCE_GGA_ALTITUDE              10
#define NMEA_FIELD_SEQUENCE_GGA_ALTITUDE_UNIT         11
#define NMEA_FIELD_SEQUENCE_GGA_SEPARATION            12
#define NMEA_FIELD_SEQUENCE_GGA_SEPARATION_UNIT       13
#define NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_AGE      14
#define NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_STATION  15
#define NMEA_FIELD_SEQUENCE_GSA_OPERATION             16
#define NMEA_FIELD_SEQUENCE_GSA_NAVIGATION            17
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_1         18
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_2         19
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_3         20
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_4         21
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_5         22
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_6         23
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_7         24
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_8         25
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_9         26
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_10        27
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_11        28
#define NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_12        29
#define NMEA_FIELD_SEQUENCE_GSA_PDOP                  30
#define NMEA_FIELD_SEQUENCE_GSA_HDOP                  31
#define NMEA_FIELD_SEQUENCE_GSA_VDOP                  32
#define NMEA_FIELD_SEQUENCE_GST_TIME                  33
#define NMEA_FIELD_SEQUENCE_GST_RANGE                 34
#define NMEA_FIELD_SEQUENCE_GST_STDDEV_MAJOR          35
#define NMEA_FIELD_SEQUENCE_GST_STDDEV_MINOR          36
#define NMEA_FIELD_SEQUENCE_GST_ORIENTATION           37
#define NMEA_FIELD_SEQUENCE_GST_STDDEV_LATITUDE       38
#define NMEA_FIELD_SEQUENCE_GST_STDDEV_LONGITUDE      39
#define NMEA_FIELD_SEQUENCE_GST_STDDEV_ALTITUDE       40
#define NMEA_FIELD_SEQUENCE_GSV_SENTENCES             41
#define NMEA_FIELD_SEQUENCE_GSV_CURRENT               42
#define NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_COUNT      43
#define NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ID         44
#define NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ELEV       45
#define NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_AZIM       46
#define NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_SNR        47
#define NMEA_FIELD_SEQUENCE_RMC_TIME                  48
#define NMEA_FIELD_SEQUENCE_RMC_STATUS                49
#define NMEA_FIELD_SEQUENCE_RMC_LATITUDE              50
#define NMEA_FIELD_SEQUENCE_RMC_LATITUDE_NS           51
#define NMEA_FIELD_SEQUENCE_RMC_LONGITUDE             52
#define NMEA_FIELD_SEQUENCE_RMC_LONGITUDE_EW          53
#define NMEA_FIELD_SEQUENCE_RMC_SPEED                 54
#define NMEA_FIELD_SEQUENCE_RMC_COURSE                55
#define NMEA_FIELD_SEQUENCE_RMC_DATE                  56
#define NMEA_FIELD_SEQUENCE_RMC_VARIATION             57
#define NMEA_FIELD_SEQUENCE_RMC_VARIATION_UNIT        58
#define NMEA_FIELD_SEQUENCE_RMC_MODE                  59
#define NMEA_FIELD_SEQUENCE_GGA_END                   60
#define NMEA_FIELD_SEQUENCE_GSA_END                   61
#define NMEA_FIELD_SEQUENCE_GST_END                   62
#define NMEA_FIELD_SEQUENCE_GSV_END                   63
#define NMEA_FIELD_SEQUENCE_RMC_END                   64

