GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static int utc_offset_time(const utc_time_t *time, uint16_t week, uint32_t tow)
{
    return ((((uint32_t)week * 604800) + ((tow + 500) / 1000)) -
	    ((((((((time->year * 365 + (1 + ((time->year -1) / 4))) +
		   utc_days_since_month[(time->year & 3) == 0][time->month -1] +
		   (time->day -1)) -
		  (6 -1) * 24) +
		 time->hours) * 60) +
	       time->minutes) * 60) +
	     time->seconds));
}

/************************************************************************************/

static void gnss_location(gnss_device_t *device)
{
    switch (device->location.type) {
    case GNSS_LOCATION_TYPE_NONE:
	device->location.mask = 0;
	device->location.numsv = 0;
	device->location.quality = GNSS_LOCATION_QUALITY_NONE;
	break;

    case GNSS_LOCATION_TYPE_TIME:
	device->location.mask &= (GNSS_LOCATION_MASK_TIME |
				  GNSS_LOCATION_MASK_CORRECTION);

	device->location.quality = GNSS_LOCATION_QUALITY_NONE;
	break;

    case GNSS_LOCATION_TYPE_2D:
	device->location.mask &= (GNSS_LOCATION_MASK_TIME |
				  GNSS_LOCATION_MASK_CORRECTION |
				  GNSS_LOCATION_MASK_POSITION |
				  GNSS_LOCATION_MASK_SPEED |
				  GNSS_LOCATION_MASK_COURSE |
				  GNSS_LOCATION_MASK_EHPE |
				  GNSS_LOCATION_MASK_HDOP);
	break;

    case GNSS_LOCATION_TYPE_3D:
	break;

    default:
	break;
    }

    if (device->location.mask & GNSS_LOCATION_MASK_TIME)
    {
	if (!(device->location.mask & GNSS_LOCATION_MASK_CORRECTION))
	{
	    device->location.correction = 0;
	}
    }
    else
    {
	device->location.time.year    = 1980 - 1980;
	device->location.time.month   = 1;
	device->location.time.day     = 6;
	device->location.time.hours   = 0;
	device->location.time.minutes = 0;
	device->location.time.seconds = 0;
	device->location.time.millis  = 0;
	device->location.correction   = 0;

	device->location.mask = 0;
	device->location.numsv = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_POSITION))
    {
	device->location.latitude = 0;
	device->location.longitude = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_ALTITUDE))
    {
	device->location.altitude = 0;
	device->location.separation = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_SPEED))
    {
	device->location.speed = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_COURSE))
    {
	device->location.course = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_CLIMB))
    {
	device->location.climb = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_EHPE))
    {
	device->location.ehpe = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_EVPE))
    {
	device->location.evpe = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_PDOP))
    {
	device->location.pdop = 9999;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_HDOP))
    {
	device->location.hdop = 9999;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_VDOP))
    {
	device->location.vdop = 9999;
    }

    if (device->callbacks->location_callback)
    {
	(*device->callbacks->location_callback)(device->context, &device->location);
    }

    device->location.type = 0;
    device->location.mask = 0;
}

static void gnss_satellites(gnss_device_t *device)
{
    if (device->satellites.count > GNSS_SATELLITES_COUNT_MAX)
    {
	device->satellites.count = GNSS_SATELLITES_COUNT_MAX;
    }

    if (device->callbacks->satellites_callback)
    {
	(*device->callbacks->satellites_callback)(device->context, &device->satellites);
    }
}

/************************************************************************************/

static const char nmea_hex_ascii[] = "0123456789ABCDEF";

static uint32_t nmea_isqrt(uint32_t n)
{  
    uint32_t c = 0x8000;  
    uint32_t g = 0x8000;  
  
    while (1)
    {  
	if((g*g) > n) 
	{
	    g ^= c;  
	}


	c >>= 1;  
	
	if(c == 0)  
	{
	    return g;  
	}

	g |= c;  
    }  
}  

static const uint32_t nmea_scale[10] = {
    1,
    10,
    100,
    1000,
    10000,
    100000,
    1000000,
    10000000,
    100000000,
    1000000000,
};

static int nmea_same_time(const utc_time_t *t0, const utc_time_t *t1)
{
    return ((t0->hours   == t1->hours) &&
	    (t0->minutes == t1->minutes) &&
	    (t0->seconds == t1->seconds) &&
	    (t0->millis  == t1->millis));
}

static int nmea_parse_time(const uint8_t *data, utc_time_t *p_time)
{
    uint32_t hours, minutes, seconds, millis, digits;

    if ((data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
    {
	hours = (data[0] - '0') * 10 + (data[1] - '0');
	data += 2;
	
	if ((hours < 24) && (data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
	{
	    minutes = (data[0] - '0') * 10 + (data[1] - '0');
	    data += 2;
	    
	    if ((minutes < 60) && (data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
	    {
		seconds = (data[0] - '0') * 10 + (data[1] - '0');
		data += 2;
		
		/* A 60 is legal here for leap seconds.
		 */
		if (seconds <= 60)
		{
		    millis = 0;
		    
		    if (data[0] == '.')
		    {
			digits = 0;
			data++;
			
			while ((data[0] >= '0') && (data[0] <= '9'))
			{
			    if (digits < 3)
			    {
				millis = millis * 10 + (data[0] - '0');
				digits++;
			    }
			    data++;
			}
			
			if (data[0] == '\0')
			{
			    if (digits < 3)
			    {
				millis = millis * nmea_scale[3 - digits];
			    }
			}
		    }
		    
		    if (data[0] == '\0')
		    {
			p_time->hours   = hours;
			p_time->minutes = minutes;
			p_time->seconds = seconds;
			p_time->millis  = millis;

			return 1;
		    }
		}
	    }
	}
    }

    return 0;
}

static int nmea_parse_unsigned(const uint8_t *data, uint32_t *p_unsigned)
{
    uint32_t integer;

    integer = 0;
                    
    while ((data[0] >= '0') && (data[0] <= '9'))
    {
	integer = integer * 10 + (data[0] - '0');
	data++;
    }

    if (data[0] == '\0')
    {
	*p_unsigned = integer;
        
	return 1;
    }

    return 0;
}

static int nmea_parse_fixed(const uint8_t *data, uint32_t *p_fixed, uint32_t scale)
{
    uint32_t integer, fraction, digits;

