GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
	    device->seen |= UBX_MESSAGE_MASK_NAV_TIMEGPS;
	    device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
	    break;

	case 0x30:
	    /* UBX-NAV-SVINFO */

	    device->ubx.generation = ubx_data_uint8(data, 5) & 7;

	    if (message == device->command)
	    {
		device->command = ~0l;
		
		ubx_configure(device, GNSS_RESPONSE_ACK, message);
	    }
	    else
	    {
		device->seen |= UBX_MESSAGE_MASK_NAV_SVINFO;
	    }
	    break;

	case 0x35:
	    /* UBX-NAV-SAT */

	    device->seen |= UBX_MESSAGE_MASK_NAV_SAT;
	    break;

	default:
	    break;
	}
    }

    else if (message == 0x0500)
    {
	/* UBX-ACK-NACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	// printf("NACK %04x\r\n", command);

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_NACK, command);
	}
    }

    else if (message == 0x0501)
    {
	/* UBX-ACK-ACK */
	command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

	// printf("ACK %04x\r\n", command);

	if (command == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_ACK, command);
	}
    }

    else if (message == 0x0a28)
    {
	// printf("RESPONSE %04x\r\n", message);

	/* UBX-NON-GNSS */
	device->ubx.gnss.supported = ubx_data_uint8(data, 1);
	device->ubx.gnss.enabled = ubx_data_uint8(data, 3);
	device->ubx.gnss.simultaneous = ubx_data_uint8(data, 4);

	if (message == device->command)
	{
	    device->command = ~0l;
	    
	    ubx_configure(device, GNSS_RESPONSE_ACK, message);
	}
    }

    if (device->init == GNSS_INIT_DONE)
    {
	expected = device->expected & (UBX_MESSAGE_MASK_NAV_DOP |
				       UBX_MESSAGE_MASK_NAV_PVT |
				       UBX_MESSAGE_MASK_NAV_TIMEGPS);
	
	if ((device->seen & expected) == expected)
	{
	    if (context->week && device->location.time.year)
	    {
		if (!(device->seen & UBX_MESSAGE_MASK_NAV_TIMEGPS))
		{
		    device->location.correction = utc_offset_time(&device->location.time, context->week, context->tow);
		}

		device->location.mask |= (GNSS_LOCATION_MASK_TIME | GNSS_LOCATION_MASK_CORRECTION);
	    }
	    
	    gnss_location(device);
	    
	    device->seen &= ~(UBX_MESSAGE_MASK_NAV_DOP |
			      UBX_MESSAGE_MASK_NAV_PVT |
			      UBX_MESSAGE_MASK_NAV_TIMEGPS);
	    
	    device->seen |= UBX_MESSAGE_MASK_SOLUTION;
	}
	
	expected = device->expected & (UBX_MESSAGE_MASK_NAV_SAT | UBX_MESSAGE_MASK_NAV_SVINFO);
	
	if ((device->seen & UBX_MESSAGE_MASK_SOLUTION) && ((device->seen & expected) == expected))
	{
	    gnss_satellites(device);
	    
	    device->seen &= ~(UBX_MESSAGE_MASK_NAV_SAT | UBX_MESSAGE_MASK_NAV_SVINFO);
	}
    }
}

static const uint8_t ubx_cfg_msg_nav_pvt[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x07,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x18, 0xe1,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_timegps[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x20,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x31, 0x90,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_dop[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x04,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x15, 0xcc,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_sat_1hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x35,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x46, 0x23,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_sat_5hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x35,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x05,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x4a, 0x37,                                     /* CK_A, CK_B                */
};

