GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_msg_nav_sat_10hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x35,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x0a,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x4f, 0x50,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_1hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x41, 0x00,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_5hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x05,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x45, 0x14,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_svinfo_10hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x30,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x0a,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x4a, 0x2d,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gga[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x00,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0xff, 0x23,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gll[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x01,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x00, 0x2a,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gsa[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x02,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x01, 0x31,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_gsv[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x03,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x02, 0x38,                                     /* CK_A, CK_B                */
};

