GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_msg_nmea_rmc[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x04,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x03, 0x3f,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nmea_vtg[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0xf0,                                           /* CLASS                     */
    0x05,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x00,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x04, 0x46,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rate_1hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x08,                                     /* CLASS, ID                 */
    0x06, 0x00,                                     /* LENGTH                    */
    0xe8, 0x03,                                     /* MEASUREMENT RATE          */
    0x01, 0x00,                                     /* NAVIGATION  RATE          */
    0x01, 0x00,                                     /* TIME REFERENCE            */
    0x01, 0x39,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rate_5hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x08,                                     /* CLASS, ID                 */
    0x06, 0x00,                                     /* LENGTH                    */
    0xc8, 0x00,                                     /* MEASUREMENT RATE          */
    0x01, 0x00,                                     /* NAVIGATION  RATE          */
    0x01, 0x00,                                     /* TIME REFERENCE            */
    0xde, 0x6a,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_rate_10hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x08,                                     /* CLASS, ID                 */
    0x06, 0x00,                                     /* LENGTH                    */
    0x64, 0x00,                                     /* MEASUREMENT RATE          */
    0x01, 0x00,                                     /* NAVIGATION  RATE          */
    0x01, 0x00,                                     /* TIME REFERENCE            */
    0x7a, 0x12,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_tp5[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x31,                                     /* CLASS, ID                 */
    0x20, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* TIMEPULSE                 */
    0x00, 0x00, 0x00,                               /*                           */
    0x32, 0x00,                                     /* ANTENNA CABLE DELAY       */
    0x00, 0x00,                                     /* RF GROUP DELAY            */
    0x40, 0x42, 0x0f, 0x00,                         /* PERIOD                    */
    0x40, 0x42, 0x0f, 0x00,                         /* PERIOD LOCKED             */
    0x40, 0x42, 0x0f, 0x00,                         /* PULSE LENGTH              */
    0xa0, 0xbb, 0x0d, 0x00,                         /* PULSE LENGTH LOCKED       */
    0x00, 0x00, 0x00, 0x00,                         /* USER DELAY                */
    0x37, 0x00, 0x00, 0x00,                         /* FLAGS                     */
    0xdb, 0x06,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_pm2[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3b,                                     /* CLASS, ID                 */
    0x2c, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* VERSION                   */
    0x00,                                           /* RESERVED1                 */
    0x00,                                           /* RESERVED2                 */
    0x00,                                           /* RESERVED3                 */
    0x00, 0x11, 0x02, 0x00,                         /* FLAGS                     */
    0xe8, 0x03, 0x00, 0x00,                         /* UPDATE PERIOD             */
    0x10, 0x27, 0x00, 0x00,                         /* SEARCH PERIOD             */
    0x00, 0x00, 0x00, 0x00,                         /* GRID OFFSET               */
    0x00, 0x00,                                     /* ON TIME                   */
    0x00, 0x00,                                     /* MIN ACQ TIME              */
    0x00, 0x00,                                     /* RESERVED4                 */
    0x00, 0x00,                                     /* RESERVED5                 */
    0x00, 0x00, 0x00, 0x00,                         /* RESERVED6                 */
    0x00, 0x00, 0x00, 0x00,                         /* RESERVED7                 */
    0x00,                                           /* RESERVED8                 */
    0x00,                                           /* RESERVED9                 */
    0x00, 0x00,                                     /* RESERVED10                */
    0x00, 0x00, 0x00, 0x00,                         /* RESERVED11                */
    0xa3, 0xae,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_gps[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x14, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x02,                                           /* NUM CONFIG BLOCKS         */
    0x00, 0x08, 0x10, 0x00, 0x01, 0x00, 0x01, 0x01, /* GPS                       */
    0x06, 0x08, 0x0e, 0x00, 0x00, 0x00, 0x01, 0x01, /* GLONASS                   */
    0x92, 0x20,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_gps_glonass[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x14, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x02,                                           /* NUM CONFIG BLOCKS         */
    0x00, 0x08, 0x10, 0x00, 0x01, 0x00, 0x01, 0x01, /* GPS                       */
    0x06, 0x08, 0x0e, 0x00, 0x01, 0x00, 0x01, 0x01, /* GLONASS                   */
    0x93, 0x24,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_sbas_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x01, 0x01, 0x03, 0x00, 0x01, 0x00, 0x01, 0x01, /* SBAS                      */
    0x58, 0xd1,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_sbas_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x01, 0x01, 0x03, 0x00, 0x00, 0x00, 0x01, 0x01, /* SBAS                      */
    0x57, 0xcd,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_gnss_qzss_enable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x3e,                                     /* CLASS, ID                 */
    0x0c, 0x00,                                     /* LENGTH                    */
    0x00,                                           /* VERSION                   */
    0x00,                                           /* NUM TRACKING CHANNELS HW  */
    0xff,                                           /* NUM TRACKING CHANNELS SW  */
    0x01,                                           /* NUM CONFIG BLOCKS         */
    0x05, 0x00, 0x03, 0x00, 0x01, 0x00, 0x01, 0x01, /* QZSS                      */
    0x5b, 0xea,                                     /* CK_A, CK_B                */
};

