GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t ubx_cfg_aop_disable[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x23,                                     /* CLASS, ID                 */
    0x28, 0x00,                                     /* LENGTH                    */
    0x00, 0x00,                                     /* VERSION                   */
    0x00, 0x40,                                     /* MASK1                     */
    0x00, 0x00, 0x00, 0x00,                         /* MASK2                     */
    0x00, 0x00,                                     /* RESERVED1                 */
    0x00,                                           /* MIN SVS                   */
    0x00,                                           /* MAX SVS                   */
    0x00,                                           /* MIN CNO                   */
    0x00,                                           /* RESERVED2                 */
    0x00,                                           /* INI FIX 3D                */
    0x00, 0x00,                                     /* RESERVED3                 */
    0x00,                                           /* ACK AIDING                */
    0x00, 0x00,                                     /* WKN ROLLOVER              */
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00,             /* RESERVED4                 */
    0x00,                                           /* USE PPP                   */
    0x00,                                           /* AOP CFG                   */
    0x00, 0x00,                                     /* RESERVED5                 */
    0x00, 0x00,                                     /* AOP ORB MAX ERR           */
    0x00, 0x00, 0x00, 0x00,                         /* RESERVED6                 */
    0x00, 0x00, 0x00,                               /* RESERVED7                 */
    0x00,                                           /* USE ADR                   */
    0x91, 0xb9,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_save[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x09,                                     /* CLASS, ID                 */
    0x0d, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* CLEAR MASK                */
    0xff, 0xff, 0xff, 0xff,                         /* SAVE MASK                 */
    0x00, 0x00, 0x00, 0x00,                         /* LOAD MASK                 */
    0x01,                                           /* DEVICE MASK               */
    0x19, 0x9c,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_rxm_pmreq[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x02, 0x41,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x00, 0x00, 0x00, 0x00,                         /* DURATION                  */
    0x02, 0x00, 0x00, 0x00,                         /* FLAGS                     */
    0x4d, 0x3b,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_nav_svinfo[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x01, 0x30,                                     /* CLASS, ID                 */
    0x00, 0x00,                                     /* LENGTH                    */
    0x31, 0x94,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_mon_gnss[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x0a, 0x28,                                     /* CLASS, ID                 */
    0x00, 0x00,                                     /* LENGTH                    */
    0x32, 0xa0,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_gnss_stop[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x04,                                     /* CLASS, ID                 */
    0x04, 0x00,                                     /* LENGTH                    */
    0x00, 0x00,                                     /* NAV BBR MASK              */
    0x08,                                           /* RESET MODE                */
    0x00,                                           /* RESERVED                  */
    0x16, 0x74,                                     /* CK_A, CK_B                */
};

static const uint8_t * const ubx_init_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_tp5,
    ubx_nav_svinfo,
    NULL,
};

static const uint8_t * const ubx_init_ublox7_1hz_table[] = {
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_1hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_1hz,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_ublox7_5hz_table[] = {
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_5hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_5hz,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_ublox7_10hz_table[] = {
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_svinfo_10hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_10hz,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_ublox8_1hz_table[] = {
    ubx_mon_gnss,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_sat_1hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_1hz,
    ubx_cfg_gnss_gps,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_aop_disable,
    ubx_cfg_save,
    NULL,
};

