GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t * const ubx_init_ublox8_5hz_table[] = {
    ubx_mon_gnss,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_sat_5hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_5hz,
    ubx_cfg_gnss_gps,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_aop_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_init_ublox8_10hz_table[] = {
    ubx_mon_gnss,
    ubx_cfg_msg_nav_pvt,
    ubx_cfg_msg_nav_timegps,
    ubx_cfg_msg_nav_dop,
    ubx_cfg_msg_nav_sat_10hz,
    ubx_cfg_msg_nmea_gga,
    ubx_cfg_msg_nmea_gll,
    ubx_cfg_msg_nmea_gsa,
    ubx_cfg_msg_nmea_gsv,
    ubx_cfg_msg_nmea_rmc,
    ubx_cfg_msg_nmea_vtg,
    ubx_cfg_rate_10hz,
    ubx_cfg_gnss_gps,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_aop_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_ant_internal_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_ant_internal,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_ant_external_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_ant_external,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_constellation_gps_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_gps,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_constellation_gps_glonass_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_gps_glonass,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_sbas_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_sbas_disable,
    ubx_cfg_sbas_none,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_sbas_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_sbas_enable,
    ubx_cfg_sbas_auto,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_qzss_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_qzss_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_aop_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_aop_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_aop_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_aop_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_gnss_stop_table[] = {
    ubx_gnss_stop,
    NULL,
};

static const uint8_t * const ubx_gnss_wakeup_table[] = {
    ubx_cfg_rxm_continuous,
    NULL,
};


static void ubx_checksum(gnss_device_t *device, uint8_t *data)
{
    uint8_t ck_a, ck_b;
    unsigned int i, count;

    count = (data[4] | (data[5] << 8)) + 8;

    ck_a = 0;
    ck_b = 0;
    
    for (i = 2; i < (count -2); i++)
    {
	ck_a += data[i];
	ck_b += ck_a;
    }
	
    data[count -2] = ck_a;
    data[count -1] = ck_b;
}

static void ubx_send(gnss_device_t *device, const uint8_t *data)
{
    uint32_t command;
    unsigned int count;

    if (data == ubx_cfg_rxm_continuous)
    {
	command = 0x0611;
	count   = sizeof(ubx_cfg_rxm_continuous);
    }
    else
    {
	command = (data[2] << 8) | data[3];
	count  = (data[4] | (data[5] << 8)) + 8;
    }

    device->command = command;
    device->busy = 1;

    // printf("COMMAND %04x\r\n", command);

    (*device->send_routine)(device->context, data, count, gnss_send_callback);
}

static void ubx_table(gnss_device_t *device, const uint8_t * const * table)
{
    const uint8_t *data;

    data = table[0];
    device->table = table + 1;

    ubx_send(device, data);

    stm32l0_rtc_timer_start(&device->ubx.timeout, 0, 4096, false); // 125ms
}

static void ubx_configure(gnss_device_t *device, unsigned int response, uint32_t command)
{
    const uint8_t *data = NULL;

    stm32l0_rtc_timer_stop(&device->ubx.timeout);

    if (device->table)
    {
	if (device->init == GNSS_INIT_UBX_BAUD_RATE)
	{
	    device->init = GNSS_INIT_UBX_INIT_TABLE;

	    device->ubx.generation = 0;
	    device->ubx.gnss.supported = 0;
	    device->ubx.gnss.enabled = 0;
	    device->ubx.gnss.simultaneous = 0;

	    data = device->table[0];
	    device->table = device->table + 1;
	}
	else
	{
	    if (command == 0x0130)
	    {
		if (device->ubx.generation <= 3)
		{
		    if      (device->rate >= 10) { device->table = ubx_init_ublox7_10hz_table; }
		    else if (device->rate >=  5) { device->table = ubx_init_ublox7_5hz_table;  }
		    else                         { device->table = ubx_init_ublox7_1hz_table;  }
		}
		else
		{
		    if      (device->rate >= 10) { device->table = ubx_init_ublox8_10hz_table; }
		    else if (device->rate >=  5) { device->table = ubx_init_ublox8_5hz_table;  }
		    else                         { device->table = ubx_init_ublox8_1hz_table;  }
		}

		data = device->table[0];
		device->table = device->table + 1;
	    }
	    else
	    {
		if (device->table[0] != NULL)
		{
		    data = device->table[0];
		    device->table = device->table + 1;
		}
		else
		{
		    device->table = NULL;

		    if (device->init == GNSS_INIT_UBX_INIT_TABLE)
		    {
			device->init = GNSS_INIT_DONE;
		
			if (device->ubx.gnss.simultaneous == 0)
			{
			    device->expected = (UBX_MESSAGE_MASK_NAV_DOP |
						UBX_MESSAGE_MASK_NAV_PVT |
						UBX_MESSAGE_MASK_NAV_SVINFO |
						UBX_MESSAGE_MASK_NAV_TIMEGPS);
			}
			else
			{
			    device->ubx.gnss.enabled = GNSS_CONSTELLATION_GPS;

			    device->expected = (UBX_MESSAGE_MASK_NAV_DOP |
						UBX_MESSAGE_MASK_NAV_PVT |
						UBX_MESSAGE_MASK_NAV_SAT |
						UBX_MESSAGE_MASK_NAV_TIMEGPS);
			}
			
			device->seen = 0;
			device->location.type = 0;
			device->location.mask = 0;
		    }
		}
	    }
	}
    }
    
    if (data)
    {
	ubx_send(device, data);

	stm32l0_rtc_timer_start(&device->ubx.timeout, 0, 4096, false); // 125ms
    }
}

static void ubx_sleep(gnss_device_t *device)
{
    if (device->callbacks->disable_callback)
    {
	(*device->callbacks->disable_callback)(device->context);
    }

    device->busy = 0;
}

static void ubx_timeout(gnss_device_t *device)
{
    const uint8_t *data = NULL;

