GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    if (device->table)
    {
	data = *(device->table -1);

	ubx_send(device, data);

	stm32l0_rtc_timer_start(&device->ubx.timeout, 0, 4096, false); // 125ms
    }
}

/************************************************************************************/

static void gnss_send_callback(void)
{
    gnss_device_t *device = &gnss_device;

    if ((device->mode == GNSS_MODE_UBLOX) && (device->command == 0x0604))
    {
	device->command = ~0l;
	
	stm32l0_rtc_timer_start(&device->ubx.sleep, 0, 4096, false); // 125ms
    }
    else
    {
	device->busy = 0;
    }
}

void gnss_receive(const uint8_t *data, uint32_t count)
{
    gnss_device_t *device = &gnss_device;
    uint8_t c;

    if (device->wakeup)
    {
	device->busy = 0;
	device->wakeup = 0;
    }

    while (count > 0)
    {
	count--;

	c = *data++;

	if ((device->state <= GNSS_STATE_NMEA_END_LF) && (c == '$'))
	{
	    /* Whenever we see a '$', it's the start of a new sentence,
	     * which can discard a partially read one.
	     */
	    
	    device->state = GNSS_STATE_NMEA_PAYLOAD;
	    device->checksum = 0x00;
	    device->rx_count = 0;

	    nmea_start_sentence(device);
	}
	else
	{
	    switch (device->state) {
	    case GNSS_STATE_START:
		if ((device->mode == GNSS_MODE_UBLOX) && (c == 0xb5))
		{
		    device->state = GNSS_STATE_UBX_SYNC_2;
		}
		break;

	    case GNSS_STATE_NMEA_PAYLOAD:
		if (c == '*')
		{
		    device->rx_data[device->rx_count] = '\0';

		    nmea_parse_sentence(device, &device->rx_data[0], device->rx_count);

		    device->state = GNSS_STATE_NMEA_CHECKSUM_1;
		}
		else if ((c >= 0x20) && (c <= 0x7f))
		{
		    if (device->rx_count >= GNSS_RX_DATA_SIZE)
		    {
			/* Reject a too long sentence.
			 */
			device->state = GNSS_STATE_START;
		    }
		    else
		    {
			device->checksum ^= c;

			if (c == ',')
			{
			    device->rx_data[device->rx_count] = '\0';
			    
			    nmea_parse_sentence(device, &device->rx_data[0], device->rx_count);

			    device->rx_count = 0;
			}
			else
			{
			    device->rx_data[device->rx_count++] = c;
			}
		    }
		}
		else
		{
		    /* If there is an illegal char, then scan again for a new start.
		     */
		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_CHECKSUM_1:
		if (c == nmea_hex_ascii[device->checksum >> 4])
		{
		    device->state = GNSS_STATE_NMEA_CHECKSUM_2;
		}
		else
		{
		    /* If there is a checksum error, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_CHECKSUM_2:
		if (c == nmea_hex_ascii[device->checksum & 0x0f])
		{
		    device->state = GNSS_STATE_NMEA_END_CR;
		}
		else
		{
		    /* If there is a checksum error, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_CR:
		if (c == '\r')
		{
		    device->state = GNSS_STATE_NMEA_END_LF;
		}
		else
		{
		    /* If there is an illegal char, then scan again for a new start.
		     */

		    device->state = GNSS_STATE_START;
		}
		break;

	    case GNSS_STATE_NMEA_END_LF:
		if (c == '\n')
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_NMEA_SENTENCE, ~0l);
			}
		    }

		    nmea_end_sentence(device);
		}
		 
		device->state = GNSS_STATE_START;
		break;

	    case GNSS_STATE_UBX_SYNC_2:
		if (c != 0x62)
		{
		    device->state = GNSS_STATE_START;
		}		
		else
		{
		    device->state = GNSS_STATE_UBX_MESSAGE_1;
		}
		break;
		
	    case GNSS_STATE_UBX_MESSAGE_1:
		device->ubx.ck_a = c;
		device->ubx.ck_b = c;
		device->ubx.message = (c << 8);
		device->state = GNSS_STATE_UBX_MESSAGE_2;
		break;
		
	    case GNSS_STATE_UBX_MESSAGE_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.message |= c;
		device->state = GNSS_STATE_UBX_LENGTH_1;
		break;

	    case GNSS_STATE_UBX_LENGTH_1:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->ubx.length = c;
		device->state = GNSS_STATE_UBX_LENGTH_2;
		break;
		
	    case GNSS_STATE_UBX_LENGTH_2:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;
		device->rx_count = 0;
		device->rx_offset = 0;
		device->rx_chunk = ~0l;
		device->ubx.length |= (c << 8);

		ubx_start_message(device, device->ubx.message, device->ubx.length);

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		else
		{
		    device->state = GNSS_STATE_UBX_PAYLOAD;
		}
		break;
	    
	    case GNSS_STATE_UBX_PAYLOAD:
		device->ubx.ck_a += c;
		device->ubx.ck_b += device->ubx.ck_a;

		if ((device->rx_count - device->rx_offset) < GNSS_RX_DATA_SIZE)
		{
		    device->rx_data[device->rx_count - device->rx_offset] = c;
		}
		
		device->rx_count++;
		
		if (device->rx_count == device->rx_chunk)
		{
		    ubx_parse_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		}

		if (device->rx_count == device->ubx.length)
		{
		    device->state = GNSS_STATE_UBX_CK_A;
		}
		break;

	    case GNSS_STATE_UBX_CK_A:
		device->ubx.ck_a ^= c;
		device->state = GNSS_STATE_UBX_CK_B;
		break;
		
	    case GNSS_STATE_UBX_CK_B:
		device->ubx.ck_b ^= c;

		if ((device->ubx.ck_a == 0x00) &&  (device->ubx.ck_b == 0x00))
		{
		    if (device->init != GNSS_INIT_DONE)
		    {
			if (device->init == GNSS_INIT_UBX_BAUD_RATE)
			{
			    ubx_configure(device, GNSS_RESPONSE_UBX_MESSAGE, ~0l);
			}
		    }

		    if ((device->rx_count - device->rx_offset) <= GNSS_RX_DATA_SIZE)
		    {
			ubx_end_message(device, device->ubx.message, &device->rx_data[0], device->rx_count);
		    }
		}

		device->state = GNSS_STATE_START;
		break;

	    default:
		break;
	    }
	}
    }
}

void gnss_initialize(unsigned int mode, unsigned int rate, unsigned int speed, gnss_send_routine_t send_routine, const gnss_callbacks_t *callbacks, void *context)
{
    gnss_device_t *device = &gnss_device;
    const char *uart_data = NULL;
    unsigned int uart_count = 0;

    device->send_routine = send_routine;
    device->callbacks = callbacks;
    device->context = context;

