GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    device->state = GNSS_STATE_START;
    device->busy = 0;
    device->wakeup = 0;
    device->command = -1;

    device->mode = mode;
    device->rate = rate;

    memset(&device->location, 0, sizeof(device->location));
    memset(&device->satellites, 0, sizeof(device->satellites));


    if (mode == GNSS_MODE_UBLOX)
    {
	device->init = GNSS_INIT_UBX_BAUD_RATE;

	device->table = ubx_init_table;

	if (speed >= 115200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,115200,0*18\r\n";
	}
	else if (speed >= 57600)
	{
	    uart_data = "$PUBX,41,1,0007,0003,57600,0*2B\r\n";
	}
	else if (speed >= 38400)
	{
	    uart_data = "$PUBX,41,1,0007,0003,38400,0*20\r\n";
	}
	else if (speed >= 19200)
	{
	    uart_data = "$PUBX,41,1,0007,0003,19200,0*25\r\n";
	}
	else
	{
	    uart_data = "$PUBX,41,1,0007,0003,9600,0*10\r\n";
	}
	
	uart_count = strlen(uart_data);

	stm32l0_rtc_timer_create(&device->ubx.sleep, (stm32l0_rtc_timer_callback_t)&ubx_sleep, device);
	stm32l0_rtc_timer_create(&device->ubx.timeout, (stm32l0_rtc_timer_callback_t)&ubx_timeout, device);
    }
    else
    {
	device->init = GNSS_INIT_DONE;
	device->table = NULL;
	device->expected = NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GPRMC;
    }

    if (uart_data)
    {
	(device->send_routine)(device->context, (const uint8_t*)uart_data, uart_count, NULL);
    }
}

bool gnss_set_antenna(unsigned int antenna)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, ((antenna == GNSS_ANTENNA_EXTERNAL) ? ubx_ant_external_table : ubx_ant_internal_table));
	break;
    }

    return true;
}

bool gnss_set_pps(unsigned int width)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	if (width > 999) {
	    width = 0;
	} else {
	    width = 1000000 - width * 1000;
	}

	data = &device->tx_data[0];
	table = &device->tx_table[0];

	memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
	
	data[ 0] = 0xb5;
	data[ 1] = 0x62;
	data[ 2] = 0x06;
	data[ 3] = 0x31;
	data[ 4] = 0x20;
	data[ 5] = 0x00;
	data[ 6] = 0x00;
	data[ 7] = 0x00;
	data[ 8] = 0x00;
	data[ 9] = 0x00;
	data[10] = 0x32;
	data[11] = 0x00;
	data[12] = 0x00;
	data[13] = 0x00;
	data[14] = (uint8_t)(1000000 >> 0);
	data[15] = (uint8_t)(1000000 >> 8);
	data[16] = (uint8_t)(1000000 >> 16);
	data[17] = (uint8_t)(1000000 >> 24);
	data[18] = (uint8_t)(1000000 >> 0);
	data[19] = (uint8_t)(1000000 >> 8);
	data[20] = (uint8_t)(1000000 >> 16);
	data[21] = (uint8_t)(1000000 >> 24);
	data[22] = (uint8_t)(1000000 >> 0);
	data[23] = (uint8_t)(1000000 >> 8);
	data[24] = (uint8_t)(1000000 >> 16);
	data[25] = (uint8_t)(1000000 >> 24);
	data[26] = (uint8_t)(width >> 0);
	data[27] = (uint8_t)(width >> 8);
	data[28] = (uint8_t)(width >> 16);
	data[29] = (uint8_t)(width >> 24);
	data[30] = 0x00;
	data[31] = 0x00;
	data[32] = 0x00;
	data[33] = 0x00;
	data[34] = width ? 0x37 : 0x00;
	data[35] = 0x00;
	data[36] = 0x00;
	data[37] = 0x00;
	
	ubx_checksum(device, data);

	table[0] = ubx_cfg_rxm_continuous;
	table[1] = ubx_cfg_pm2,
	table[2] = &data[0];
	table[3] = ubx_cfg_save;
	table[4] = NULL;

	ubx_table(device, table);
    }

    return true;
}

bool gnss_set_constellation(unsigned int mask)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	if (device->ubx.gnss.simultaneous) {
	    mask = (mask & device->ubx.gnss.supported) | GNSS_CONSTELLATION_GPS;

	    if (device->ubx.gnss.enabled != mask) {
		device->ubx.gnss.enabled = mask;

		ubx_table(device, ((mask & GNSS_CONSTELLATION_GLONASS) ? ubx_constellation_gps_glonass_table : ubx_constellation_gps_table));
	    }
	}
	break;
    }

    return true;
}

bool gnss_set_sbas(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (enable ? ubx_sbas_enable_table :  ubx_sbas_disable_table));
	break;
    }

    return true;
}

bool gnss_set_qzss(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (enable ? ubx_qzss_enable_table :  ubx_qzss_disable_table));
	break;
    }

    return true;
}

bool gnss_set_autonomous(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	if (device->ubx.generation >= 4) {
	    ubx_table(device, (enable ? ubx_aop_enable_table :  ubx_aop_disable_table));
	}
	break;
    }

    return true;
}

bool gnss_set_platform(unsigned int platform)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;

    static const uint8_t ubx_platform_table[GNSS_PLATFORM_COUNT] = {
	0x00, /* PORTABLE   */
	0x02, /* STATIONARY */
	0x03, /* PEDESTRIAN */
	0x04, /* CAR        */
	0x05, /* SEA        */
	0x06, /* BALLON     */
	0x07, /* AVIATION   */
    };

    if (gnss_busy())
    {
	return false;
    }

    if (platform >= GNSS_PLATFORM_COUNT)
    {
	return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
	break;
    case GNSS_MODE_UBLOX:
	data = &device->tx_data[0];
	table = &device->tx_table[0];

	memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
	
	data[ 0] = 0xb5;
	data[ 1] = 0x62;
	data[ 2] = 0x06;
	data[ 3] = 0x24;
	data[ 4] = 0x24;
	data[ 5] = 0x00;
	data[ 6] = 0x01;
	data[ 7] = 0x00;
	data[ 8] = ubx_platform_table[platform];
	
	ubx_checksum(device, data);

	table[0] = ubx_cfg_rxm_continuous;
	table[1] = ubx_cfg_pm2,
	table[2] = &data[0];
	table[3] = ubx_cfg_save;
	table[4] = NULL;

	ubx_table(device, table);
    }

